# DWGImportOptions Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWGImportOptions Constructor
DWGImportOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DWGImportOptions()()()() | Constructs a new instance of DWGImportOptions with default values of all properties. |
| DWGImportOptions(DWGImportOptions) | Constructs a new instance of DWGImportOptions as a copy of the import options. |

# See Also
DWGImportOptions Class
DWGImportOptions Members
Autodesk.Revit.DB Namespace